InformationRegisters/ОбязательныеРеквизитыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОбязательныеРеквизитыОбъектов</Name>
			<Comment>Обязательные (при интерактивном вводе элемента) поля</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТолькоПриЗаписиНового</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЗапрещатьЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ОбязательныеРеквизитыОбъектов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Стандартные проверяемые реквизиты справочников.
// 
// Возвращаемое значение:
// Структура  - Структура с полями регистра сведений "Обязательные реквизиты объектов"
//
Функция ПолучитьСтандартныеРеквизиты() Экспорт
	
	СтандартныеРеквизиты = Новый Массив;
	
	СтруктураРеквизита = Новый Структура;
	СтруктураРеквизита.Вставить("ИмяСправочника", "Клиенты");
	СтруктураРеквизита.Вставить("ИмяРеквизита", "ДатаРождения");
	СтруктураРеквизита.Вставить("ИмяРеквизитаПредставление", "Дата рождения");
	СтруктураРеквизита.Вставить("ТолькоПриЗаписиНового", Ложь);
	
	СтандартныеРеквизиты.Добавить(СтруктураРеквизита);
	
	СтруктураРеквизита = Новый Структура;
	СтруктураРеквизита.Вставить("ИмяСправочника", "Клиенты");
	СтруктураРеквизита.Вставить("ИмяРеквизита", ПрефиксРеквизитовВидовКИ() + ОбозначениеЛюбойТелефон());
	СтруктураРеквизита.Вставить("ИмяРеквизитаПредставление", "Любой телефон");
	СтруктураРеквизита.Вставить("ТолькоПриЗаписиНового", Истина);
	
	СтандартныеРеквизиты.Добавить(СтруктураРеквизита);
	
	СтруктураРеквизита = Новый Структура;
	СтруктураРеквизита.Вставить("ИмяСправочника", "Клиенты");
	СтруктураРеквизита.Вставить("ИмяРеквизита", ПрефиксРеквизитовВидовКИ() + Справочники.ВидыКонтактнойИнформации.ТелефонСотовый.ИмяПредопределенныхДанных);
	СтруктураРеквизита.Вставить("ИмяРеквизитаПредставление", "Сотовый телефон");
	СтруктураРеквизита.Вставить("ТолькоПриЗаписиНового", Истина);
	
	СтандартныеРеквизиты.Добавить(СтруктураРеквизита);
	
	Возврат СтандартныеРеквизиты;
		
КонецФункции

// Проверяет заполненность обязательных реквизитов
//
// Параметры:
//  Объект		 - Ссылка Или Структура	 - Объект с полями на проверку
//  НовыйОбъект	 - Булево				 - Истина, если объект еще не записан
//  Отказ		 - Булево				 - Истина, если отказано в записи
// 
// Возвращаемое значение:
//  Строка - Текст ошибки
//
Функция ПроверитьЗаполненностьОбязательныхРеквизитов(Объект, НовыйОбъект, Отказ) Экспорт
	
	Если Найти(Строка(ТипЗнч(Объект)),"Ссылка" ) > 0 Тогда
		Возврат ПроверитьЗаполненностьОбязательныхРеквизитовСсылка(Объект, НовыйОбъект, Отказ); 
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда  	
		Возврат ПроверитьЗаполненностьОбязательныхРеквизитовСтруктура(Объект, НовыйОбъект, Отказ);
	КонецЕсли;
	
КонецФункции

// Описание вида контактной информации для редактирования проверок и вывода пользователю.
//
// Параметры:
//  ВидКИ	 - СправочникСсылка.ВидКонтактнойИнформации	 - вид контактной информации	 
// 
// Возвращаемое значение:
//  Структура - Структура, состоящая из двух строк: строкового идентификатора вида и представления при настройке проверки.
//
Функция ОписаниеПроверяемогоВидаКИ(ВидКИ) Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	Если ЗначениеЗаполнено(ВидКИ.ИмяПредопределенныхДанных) Тогда
		СтруктураВозврата.Вставить("ИмяРеквизита", ПрефиксРеквизитовВидовКИ() + ВидКИ.ИмяПредопределенныхДанных);
		СтруктураВозврата.Вставить("Представление",ПредставлениеРеквизитаКИ(ВидКИ.ИмяПредопределенныхДанных));
	Иначе
		СтруктураВозврата.Вставить("ИмяРеквизита", ПрефиксРеквизитовВидовКИ() + СтрЗаменить(ВидКИ.УникальныйИдентификатор(), "-", "_"));
		СтруктураВозврата.Вставить("Представление", ВидКИ.Наименование);		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Представление проверяемого реквизита на базе вида контакнтой информации.
//
// Параметры:
//  ИмяРеквизита - Строка - Внутреннее имя проверяемого реквизита.  
// 
// Возвращаемое значение:
//  Строка.
//
Функция ПредставлениеРеквизитаКИ(ИмяРеквизита) Экспорт
	
	Попытка
		
		УИД = СтрЗаменить(ИмяРеквизита, "_", "-");
		
		Ссылка = Справочники.ВидыКонтактнойИнформации.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		
		Возврат Ссылка.Наименование;
		
	Исключение 
		
		Синоним = ИмяРеквизита;
		
		Для Индекс = 2 По СтрДлина(Синоним) Цикл
			
			Символ = Сред(Синоним, Индекс, 1);
			Если Врег(Символ) = Символ Тогда
				Синоним = Лев(Синоним, Индекс - 1) + " " + Нрег(Символ) + Прав(Синоним, Стрдлина(Синоним) - Индекс);	
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Синоним;
			
	КонецПопытки;
		
КонецФункции

// Константа префикса проверяемых реквизитов на основе видов контактной информации.
// 
// Возвращаемое значение:
//  Строка. 
//
Функция ПрефиксРеквизитовВидовКИ() Экспорт
	
	Возврат "КонтактнаяИнформация";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбозначениеЛюбойТелефон()
	
	Возврат "Телефон";
	
КонецФункции

Функция ПроверитьЗаполненностьОбязательныхРеквизитовСсылка(Объект, НовыйОбъект, Отказ)
	
	Результат = Новый Структура("ТекстОшибки, СтруктураОшибки", "", Новый Массив);
	
	СписокОбязательныхРеквизитов = ПолучитьСписокОбязательныхРеквизитов(Объект.Ссылка);
	Для Каждого ЭлементСпискаРеквизит Из СписокОбязательныхРеквизитов  Цикл
		Если Не ЭлементСпискаРеквизит.ТолькоПриЗаписиНового Или (ЭлементСпискаРеквизит.ТолькоПриЗаписиНового И НовыйОбъект) Тогда 
			Попытка
				Если Не ЗначениеЗаполнено(Объект[ЭлементСпискаРеквизит.Значение])  Тогда
					ДобавитьОписаниеНеЗаполненногоРеквизита(Результат, ЭлементСпискаРеквизит, Отказ);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьЗаполненностьОбязательныхРеквизитовСтруктура(Объект, НовыйОбъект, Отказ)
	
	Результат = Новый Структура("ТекстОшибки, СтруктураОшибки", "", Новый Массив);
	
	ПроверятьКИТолькоТелефоны = Объект.Свойство("КИПроверятьТолькоТелефоны") И Объект.КИПроверятьТолькоТелефоны;
	
	СписокОбязательныхРеквизитов = ПолучитьСписокОбязательныхРеквизитов(Объект.Ссылка, ПроверятьКИТолькоТелефоны);
	Для Каждого ЭлементСпискаРеквизит Из СписокОбязательныхРеквизитов  Цикл
		Если (Не ЭлементСпискаРеквизит.ТолькоПриЗаписиНового Или (ЭлементСпискаРеквизит.ТолькоПриЗаписиНового И НовыйОбъект)) 
			И (Не (Объект.Свойство(ЭлементСпискаРеквизит.Значение) И ЗначениеЗаполнено(Объект[ЭлементСпискаРеквизит.Значение]))) 
		Тогда
			ДобавитьОписаниеНеЗаполненногоРеквизита(Результат, ЭлементСпискаРеквизит, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОписаниеНеЗаполненногоРеквизита(ОписаниеОшибки, ПроверяемыйРеквизит, Отказ)
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru ='Поле ""%1"" не заполнено'"), ПроверяемыйРеквизит.Представление);
	Если ПроверяемыйРеквизит.НеЗапрещатьЗапись Тогда
		ТекстОшибки = ТекстОшибки + " (не обязательное)";
	Иначе
		Отказ = Истина;
	КонецЕсли;
	ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(ОписаниеОшибки.ТекстОшибки, ТекстОшибки, Символы.ПС);
	ОписаниеОшибки.СтруктураОшибки.Добавить(Новый Структура("ТекстОшибки, ПутьКДанным", ТекстОшибки, ПроверяемыйРеквизит.Значение));

КонецПроцедуры

Функция ПолучитьСписокОбязательныхРеквизитов(ЭлементСсылка, ПроверятьКИТолькоТелефоны = Ложь)
	
	МетаданныеОбъекта = ЭлементСсылка.Метаданные();
	
	ОбязательныеРеквизиты = РегистрыСведений.ОбязательныеРеквизитыОбъектов.СоздатьНаборЗаписей();
    ОбязательныеРеквизиты.Отбор.ИмяСправочника.Установить(МетаданныеОбъекта.Имя);
    ОбязательныеРеквизиты.Прочитать();
	
	ТаблицаОбязательныхРеквизитов = Новый ТаблицаЗначений;
	ТаблицаОбязательныхРеквизитов.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
	ТаблицаОбязательныхРеквизитов.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	ТаблицаОбязательныхРеквизитов.Колонки.Добавить("ТолькоПриЗаписиНового", Новый ОписаниеТипов("Булево"));
	ТаблицаОбязательныхРеквизитов.Колонки.Добавить("НеЗапрещатьЗапись", Новый ОписаниеТипов("Булево"));
	
	Для Каждого ЗаписьРеквизит Из ОбязательныеРеквизиты Цикл
		
		МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.Найти(ЗаписьРеквизит.ИмяРеквизита);
		Если МетаданныеРеквизита <> Неопределено Тогда
			ОбязательныйРеквизит = ТаблицаОбязательныхРеквизитов.Добавить();
			ОбязательныйРеквизит.Значение = ЗаписьРеквизит.ИмяРеквизита;
			ОбязательныйРеквизит.Представление = МетаданныеРеквизита.Синоним;
			ОбязательныйРеквизит.ТолькоПриЗаписиНового = ЗаписьРеквизит.ТолькоПриЗаписиНового;
			ОбязательныйРеквизит.НеЗапрещатьЗапись = ЗаписьРеквизит.НеЗапрещатьЗапись;
		ИначеЕсли Найти(ЗаписьРеквизит.ИмяРеквизита, ПрефиксРеквизитовВидовКИ()) > 0 Тогда
			
			// Исключаем не телефоны, если не подлежат проверке
			Если ПроверятьКИТолькоТелефоны Тогда
				Если ЗначениеЗаполнено(ЗаписьРеквизит.ПредметПроверки) Тогда
					ВидКИ = ЗаписьРеквизит.ПредметПроверки;
				Иначе
					ИмяПредопределенного = СтрЗаменить(ЗаписьРеквизит.ИмяРеквизита, ПрефиксРеквизитовВидовКИ(), "");
					
					Если ИмяПредопределенного = ОбозначениеЛюбойТелефон() Тогда
						ВидКИ = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
					Иначе
						// Предопределннный
						Попытка
							ВидКИ = Справочники.ВидыКонтактнойИнформации[ИмяПредопределенного];
						Исключение
							Продолжить;
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
				Если ВидКИ.Тип <> Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ОбязательныйРеквизит = ТаблицаОбязательныхРеквизитов.Добавить();
			ОбязательныйРеквизит.Значение = ЗаписьРеквизит.ИмяРеквизита;
			ОбязательныйРеквизит.Представление = ПредставлениеРеквизитаКИ(Прав(ЗаписьРеквизит.ИмяРеквизита, СтрДлина(ЗаписьРеквизит.ИмяРеквизита) - 20));
			ОбязательныйРеквизит.ТолькоПриЗаписиНового = ЗаписьРеквизит.ТолькоПриЗаписиНового;
			ОбязательныйРеквизит.НеЗапрещатьЗапись = ЗаписьРеквизит.НеЗапрещатьЗапись;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаОбязательныхРеквизитов;
	
КонецФункции 

#КонецОбласти
